Revit 2024 API
BuiltInFailures.InaccurateFailures.InaccurateRoomSeparation Property
 Room separation line is slightly off axis and may cause inaccuracies.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InaccurateRoomSeparation { get; }
Visual Basic
Public Shared ReadOnly Property InaccurateRoomSeparation As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InaccurateRoomSeparation {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.InaccurateFailures Class
Autodesk.Revit.DB Namespace